#Область ПрограммныйИнтерфейс 

Процедура ДополнитьФорму(форма) Экспорт
	Имяформы = Форма.ИмяФормы;
	
	Если Имяформы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма); 
		ДобавитьПолеСогласованнаяСкидкаИКоманду(Форма);		
	ИначеЕсли Имяформы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли Имяформы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли Имяформы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(форма);
	ИначеЕсли Имяформы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти   

#Область СлужебныйПрограммныйИнтерфейс 


Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(форма)
	ПолеВвода = форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(форма)
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";
КонецПроцедуры  

Процедура ДобавитьПолеСогласованнаяСкидкаИКоманду(форма) 
	
	ГруппаСкидки = Форма.Элементы.Добавить("ГруппаСкидки", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	ГруппаСкидки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидки.Отображение = ОтображениеОбычнойГруппы.Нет; 
	ГруппаСкидки.ОтображатьЗаголовок = Ложь; 
	ГруппаСкидки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ПолеВвода = форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), ГруппаСкидки);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.СогласованнаяСкидка";
	ПолеВвода.Заголовок = "Согласованная скидка,%";
	ПолеВвода.УстановитьДействие ("ПриИзменении", "СогласованнаяСкидкаПриИзменении"); 
    ПолеВвода.КнопкаВыбора = Истина;
   	
	НоваяКоманда = Форма.Команды.Добавить("ПересчитатьТаблицу");
	НоваяКоманда.Заголовок = "Пересчитать таблицу";
	НоваяКоманда.Действие = "ПересчитатьТаблицу";
	
	Кнопка = форма.Элементы.Добавить("ПересчитатьТаблицу", Тип("КнопкаФормы"), ГруппаСкидки); 
	Кнопка.Заголовок = "Пересчитать таблицу";
	Кнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	Кнопка.ИмяКоманды = "ПересчитатьТаблицу";
	Кнопка.Картинка = БиблиотекаКартинок.Обновить;
	Кнопка.ПоложениеКартинки = ПоложениеКартинкиКнопкиФормы.Лево; 
	Кнопка.Отображение = ОтображениеКнопки.КартинкаИТекст;  
	
КонецПроцедуры


#КонецОбласти  